Revit 2026 API

# ViewportPositioning Enumeration

---

**Note: This API is now obsolete.**

An enumerated type listing of viewport positioning options on the sheet when swapped to another view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use ViewAnchor instead.")]
public enum ViewportPositioning
```
```vb
<ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use ViewAnchor instead.")>
Public Enumeration ViewportPositioning
```
```cpp
[ObsoleteAttribute(L"This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use ViewAnchor instead.")]
public enum class ViewportPositioning
```
```fsharp
[<ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use ViewAnchor instead.")>]
type ViewportPositioning
```

| Member name | Value | Description |
| --- | --- | --- |
| ViewOrigin | 1 | When swapping to another view, the viewport location will be based on the view origin. |
| ViewportCenter | 0 | When swapping to another view, the center of the viewport will be maintained. |

#### Reference

Autodesk.Revit.DB Namespace